{
  "main": {
    "name": "Calvin Thang",
    "occupation": "Founder of calvieTech",
    "description": "I am a Full-Stack developer.",
    "image": "profilepic.jpg",
    "bio": "Hey, wassup?  My name is Calvin! I've been coding for over 5 years now. As a Full Stack developer, I've worked both with startups, non-profit organizations, church groups, small, medium and large corporations to help build & scale their companies. I have always been interested in computers and technology in general.  As I kept going forward with my journey, I realised that I was passionate about helping companies develop a well polished online presence. With this passion, I have gained much experience through practice. Through lots of trial & error, painful debugging sessions, and drinking copious amounts of coffee, I have developed several full-stack projects demonstrating my developer skills in front-end, back-end and software development in general. I deliver REAL VALUE by teaching REAL WORLD projects to help businesses and organizations promote growth by having an amazing online presence",
    "contactmessage": "Get in touch with with me if your inquiring about potential business opportunities or you want to hire me for software employment positions!",
    "email": "calvieTech@gmail.com",
    "phone": "(631) 371-4575",
    "address": {
      "street": "Long Island",
      "city": "New York",
      "state": "NY",
      "zip": "11040"
    },
    "website": "https://www.calvieTech.dev",
    "resumedownload": "resume.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/cthang94/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "gmail",
        "url": "mailto:calthang94@gmail.com",
        "className": "fa fa-envelope"
      },
      {
        "name": "github",
        "url": "https://github.com/calvieTech",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My Programming Language Proficiency",
    "education": [
      {
        "school": "Queens College, City University of New York",
        "degree": "Bachelors of Arts in Computer Science",
        "starting_year": "Spring 2018",
        "ending_year": "Winter 2021",
        "description": "Graduated with a 3.33 GPA",
        "coursework": "Object-Oriented Programming in Java | Data Structures | Design & Analysis of Algorithms | Databases | Operating Systems | Cloud Computing"
      }
    ],
    "work": [
      {
        "company": "United States Census Bureau",
        "title": "Field Representative",
        "location": "Nassau County,  NY",
        "starting_year": "Sept 2021",
        "ending_year": "Current",
        "description": [
          "Interviewed respondents to collect survey or census data as required for current, on-going surveys, one-time surveys, and special census",
          "Communicated and coordinated with respondents, supervisors, and other persons in a professional manner",
          "Studied the survey materials and the learning modules for better preparation in conducting door-to-door surveys",
          "Maintained personal payroll records that reflect number of hours worked, miles driven, and reimbursements for travel claimed",
          "Explained the purpose of the survey, asks questions as worded on the questionnaire or survey instrument, and enters accurate and complete information into a laptop computer or onto survey forms"
        ]
      },
      {
        "company": "Rosenthal Library at Queens College",
        "title": "Front-Desk Aide",
        "location": "Flushing,  NY",
        "starting_year": "Aug 2018",
        "ending_year": "Mar 2020",
        "description": [
          "Assisted with front-desk operations of the library, providing tech support on an ad-hoc and as-needed basis and acting as the first contact for students and faculty regarding books and multimedia devices.",
          "Diagnosed mobile device errors and implemented efficient technical solutions, contributing to a virus-free IT system at the library",
          "Maintained data integrity of thousands of records for the college utilizing the CUNY library system to warehouse the data"
        ]
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "75%"
      },
      {
        "name": "Java",
        "level": "85%"
      },
      {
        "name": "Git",
        "level": "70%"
      },
      {
        "name": "JavaScript",
        "level": "87%"
      },
      {
        "name": "Web Development",
        "level": "85%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "YEETFLIX (React JS)",
        "category": "Movie Trailer App",
        "image": "yeetflix.png",
        "url": "https://yeetflex-1d350.web.app/"
      },
      {
        "title": "Amazoni (React JS)",
        "category": "E-Commerce App",
        "image": "amazoni.png",
        "url": "https://i-ff344.firebaseapp.com/"
      },
      {
        "title": "M.B.C New York (React JS)",
        "category": "Non-profit Church App",
        "image": "mbcny.png",
        "url": "https://mbcnewyork.org/"
      },
      {
        "title": "TBD (React JS)",
        "category": "You'll find out soon ;)",
        "image": "tbd.png",
        "url": "https://www.youtube.com/watch?v=dQw4w9WgXcQ"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Calvin is absolutely excellent, his depth of knowledge, ability to work in a team, and solve problems really meant a lot to us... I would definitely recommend",
        "user": "mbcnewyork.org"
      },
      {
        "text": "Working with Calvin has been AWESOME, he makes coding look like a videogame or a puzzle.  Not only that but he is approachable and friendly, good coder and even better team player!",
        "user": "Chris Mule"
      }
    ]
  }
}